providers/InfoProviderEPUComponent/test/Invoker/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:epu="http://modalis.polytech.unice.fr/jSeduite/schema/InfoProvider/epu">
  <soapenv:Body>
    <epu:InfoProviderRequest>
      <epu:user>hall</epu:user>
      <epu:password>llah</epu:password>
    </epu:InfoProviderRequest>
  </soapenv:Body>
</soapenv:Envelope>